// ОФИЦИАЛЬНЫЕ УРОВНИ MICROBAN - ВСЕ 155 УРОВНЕЙ
// Автор: David W. Skinner, 2000
// Источник: http://www.sneezingtiger.com/sokoban/levels/microbanText.html

export interface Level {
  name: string;
  data: string;
  norma: number;
}

export const LEVELS: Level[] = [
  // Microban #1
  {
    name: "Microban 1",
    norma: 45,
    data: `
####
# .#
#  ###
#*@  #
#  $ #
#  ###
####
`
  },
  // Microban #2
  {
    name: "Microban 2",
    norma: 55,
    data: `
######
#    #
# #@ #
# $* #
# .* #
#    #
######
`
  },
  // Microban #3
  {
    name: "Microban 3",
    norma: 65,
    data: `
  ####
###  ####
#     $ #
# #  #$ #
# . .#@ #
#########
`
  },
  // Microban #4
  {
    name: "Microban 4",
    norma: 45,
    data: `
########
#      #
# .**$@#
#      #
#####  #
    ####
`
  },
  // Microban #5
  {
    name: "Microban 5",
    norma: 60,
    data: `
 #######
 #     #
 # .$. #
## $@$ #
#  .$. #
#      #
########
`
  },
  // Microban #6
  {
    name: "Microban 6",
    norma: 100,
    data: `
###### #####
#    ###   #
# $$     #@#
# $ #...   #
#   ########
#####
`
  },
  // Microban #7
  {
    name: "Microban 7",
    norma: 80,
    data: `
#######
#     #
# .$. #
# $.$ #
# .$. #
# $.$ #
#  @  #
#######
`
  },
  // Microban #8
  {
    name: "Microban 8",
    norma: 100,
    data: `
  ######
  # ..@#
  # $$ #
  ## ###
   # #
   # #
#### #
#    ##
# #   #
#   # #
###   #
  #####
`
  },
  // Microban #9
  {
    name: "Microban 9",
    norma: 50,
    data: `
#####
#.  ##
#@$$ #
##   #
 ##  #
  ##.#
   ###
`
  },
  // Microban #10
  {
    name: "Microban 10",
    norma: 70,
    data: `
      #####
      #.  #
      #.# #
#######.# #
# @ $ $ $ #
# # # # ###
#       #
#########
`
  },
  // Microban #11
  {
    name: "Microban 11",
    norma: 55,
    data: `
  ######
  #    #
  # ##@##
### # $ #
# ..# $ #
#       #
#  ######
####
`
  },
  // Microban #12
  {
    name: "Microban 12",
    norma: 60,
    data: `
#####
#   ##
# $  #
## $ ####
 ###@.  #
  #  .# #
  #     #
  #######
`
  },
  // Microban #13
  {
    name: "Microban 13",
    norma: 50,
    data: `
####
#. ##
#.@ #
#. $#
##$ ###
 # $  #
 #    #
 #  ###
 ####
`
  },
  // Microban #14
  {
    name: "Microban 14",
    norma: 30,
    data: `
#######
#     #
# # # #
#. $*@#
#   ###
#####
`
  },
  // Microban #15
  {
    name: "Microban 15",
    norma: 45,
    data: `
     ###
######@##
#    .* #
#   #   #
#####$# #
    #   #
    #####
`
  },
  // Microban #16
  {
    name: "Microban 16",
    norma: 55,
    data: `
 ####
 #  ####
 #     ##
## ##   #
#. .# @$##
#   # $$ #
#  .#    #
##########
`
  },
  // Microban #17
  {
    name: "Microban 17",
    norma: 35,
    data: `
#####
# @ #
#...#
#$$$##
#    #
#    #
######
`
  },
  // Microban #18
  {
    name: "Microban 18",
    norma: 45,
    data: `
#######
#     #
#. .  #
# ## ##
#  $ #
###$ #
  #@ #
  #  #
  ####
`
  },
  // Microban #19
  {
    name: "Microban 19",
    norma: 35,
    data: `
########
#   .. #
#  @$$ #
##### ##
   #  #
   #  #
   #  #
   ####
`
  },
  // Microban #20
  {
    name: "Microban 20",
    norma: 45,
    data: `
#######
#     ###
#  @$$..#
#### ## #
  #     #
  #  ####
  #  #
  ####
`
  },
  // Microban #21
  {
    name: "Microban 21",
    norma: 30,
    data: `
####
#  ####
# . . #
# $$#@#
##    #
 ######
`
  },
  // Microban #22
  {
    name: "Microban 22",
    norma: 50,
    data: `
#####
#   ###
#. .  #
#   # #
## #  #
 #@$$ #
 #    #
 #  ###
 ####
`
  },
  // Microban #23
  {
    name: "Microban 23",
    norma: 25,
    data: `
#######
#  *  #
#     #
## # ##
 #$@.#
 #   #
 #####
`
  },
  // Microban #24
  {
    name: "Microban 24",
    norma: 35,
    data: `
# #####
  #   #
###$$@#
#   ###
#     #
# . . #
#######
`
  },
  // Microban #25
  {
    name: "Microban 25",
    norma: 45,
    data: `
 ####
 #  ###
 # $$ #
##... #
#  @$ #
#   ###
#####
`
  },
  // Microban #26
  {
    name: "Microban 26",
    norma: 40,
    data: `
 #####
 # @ #
 #   #
###$ #
# ...#
# $$ #
###  #
  ####
`
  },
  // Microban #27
  {
    name: "Microban 27",
    norma: 40,
    data: `
######
#   .#
# ## ##
#  $$@#
# #   #
#.  ###
#####
`
  },
  // Microban #28
  {
    name: "Microban 28",
    norma: 30,
    data: `
#####
#   #
# @ #
# $$###
##. . #
 #    #
 ######
`
  },
  // Microban #29
  {
    name: "Microban 29",
    norma: 70,
    data: `
     #####
     #   ##
     #    #
 ######   #
##     #. #
# $ $ @  ##
# ######.#
#        #
##########
`
  },
  // Microban #30
  {
    name: "Microban 30",
    norma: 35,
    data: `
####
#  ###
# $$ #
#... #
# @$ #
#   ##
#####
`
  },
  // Microban #31
  {
    name: "Microban 31",
    norma: 45,
    data: `
  ####
 ##  #
##@$.##
# $$  #
# . . #
###   #
  #####
`
  },
  // Microban #32
  {
    name: "Microban 32",
    norma: 35,
    data: `
 ####
##  ###
#     #
#.**$@#
#   ###
##  #
 ####
`
  },
  // Microban #33
  {
    name: "Microban 33",
    norma: 40,
    data: `
#######
#. #  #
#  $  #
#. $#@#
#  $  #
#. #  #
#######
`
  },
  // Microban #34
  {
    name: "Microban 34",
    norma: 45,
    data: `
  ####
###  ####
#       #
#@$***. #
#       #
#########
`
  },
  // Microban #35
  {
    name: "Microban 35",
    norma: 55,
    data: `
  ####
 ##  #
 #. $#
 #.$ #
 #.$ #
 #.$ #
 #. $##
 #   @#
 ##   #
  #####
`
  },
  // Microban #36
  {
    name: "Microban 36",
    norma: 50,
    data: `
####
#  ############
# $ $ $ $ $ @ #
# .....       #
###############
`
  },
  // Microban #37
  {
    name: "Microban 37",
    norma: 55,
    data: `
      ###
##### #.#
#   ###.#
#   $ #.#
# $  $  #
#####@# #
    #   #
    #####
`
  },
  // Microban #38
  {
    name: "Microban 38",
    norma: 60,
    data: `
##########
#        #
# ##.### #
# # $$ . #
# . @$## #
#####    #
    ######
`
  },
  // Microban #39
  {
    name: "Microban 39",
    norma: 65,
    data: `
#####
#   ####
# # # .#
#    $ ###
### #$.  #
#   #@   #
# # ######
#   #
#####
`
  },
  // Microban #40
  {
    name: "Microban 40",
    norma: 25,
    data: `
 #####
 #   #
##   ##
# $$$ #
# .+. #
#######
`
  },
  // Microban #41
  {
    name: "Microban 41",
    norma: 40,
    data: `
#######
#     #
#@$$$ ##
#  #...#
##    ##
 ######
`
  },
  // Microban #42
  {
    name: "Microban 42",
    norma: 30,
    data: `
   ####
   #  #
   #@ #
####$.#
#   $.#
# # $.#
#    ##
######
`
  },
  // Microban #43
  {
    name: "Microban 43",
    norma: 45,
    data: `
     ####
     # @#
     #  #
###### .#
#   $  .#
#  $$# .#
#    ####
###  #
  ####
`
  },
  // Microban #44 - "Duh!"
  {
    name: "Duh!",
    norma: 5,
    data: `
#####
#@$.#
#####
`
  },
  // Microban #45
  {
    name: "Microban 45",
    norma: 40,
    data: `
######
#... #
#  $ #
# #$##
#  $ #
#  @ #
######
`
  },
  // Microban #46
  {
    name: "Microban 46",
    norma: 45,
    data: `
 ######
##    #
#  ## #
# # $ #
#  * .#
## #@##
 #   #
 #####
`
  },
  // Microban #47
  {
    name: "Microban 47",
    norma: 55,
    data: `
  #######
###     #
# $ $   #
# ### #####
# @ . .   #
#   ###   #
##### #####
`
  },
  // Microban #48
  {
    name: "Microban 48",
    norma: 50,
    data: `
######
#  @ #
#  # ##
# .#  ##
# .$$$ #
# .#   #
####   #
   #####
`
  },
  // Microban #49
  {
    name: "Microban 49",
    norma: 55,
    data: `
######
# @  #
# $# #
# $  #
# $ ##
### ####
 #  #  #
 #...  #
 #     #
 #######
`
  },
  // Microban #50
  {
    name: "Microban 50",
    norma: 50,
    data: `
  ####
###  #####
#  $  @..#
# $    # #
### #### #
  #      #
  ########
`
  },
  // Microban #51
  {
    name: "Microban 51",
    norma: 40,
    data: `
####
#  ###
#    ###
#  $*@ #
### .# #
  #    #
  ######
`
  },
  // Microban #52
  {
    name: "Microban 52",
    norma: 35,
    data: `
  ####
### @#
#  $ #
#  *.#
#  *.#
#  $ #
###  #
  ####
`
  },
  // Microban #53
  {
    name: "Microban 53",
    norma: 50,
    data: `
 #####
##. .##
# * * #
#  #  #
# $ $ #
## @ ##
 #####
`
  },
  // Microban #54
  {
    name: "Microban 54",
    norma: 70,
    data: `
      ######
      #    #
  ##### .  #
###  ###.  #
# $  $  . ##
# @$$ # . #
##    #####
 ######
`
  },
  // Microban #55
  {
    name: "Microban 55",
    norma: 60,
    data: `
########
# @ #  #
#      #
#####$ #
    #  ###
 ## #$ ..#
 ## #  ###
    ####
`
  },
  // Microban #56
  {
    name: "Microban 56",
    norma: 30,
    data: `
#####
#   ###
#  $  #
##* . #
 #   @#
 ######
`
  },
  // Microban #57
  {
    name: "Microban 57",
    norma: 40,
    data: `
  ####
  #  #
  #@ #
  #  #
### ####
#    * #
#  $   #
#####. #
    ####
`
  },
  // Microban #58
  {
    name: "Microban 58",
    norma: 40,
    data: `
####
#  ####
#.*$  #
# .$# #
## @  #
 #   ##
 #####
`
  },
  // Microban #59
  {
    name: "Microban 59",
    norma: 90,
    data: `
############
#          #
# ####### @##
# #         #
# #  $   #  #
# $$ #####  #
###  # # ...#
  #### #    #
       ######
`
  },
  // Microban #60
  {
    name: "Microban 60",
    norma: 80,
    data: `
 #########
 #       #
##@##### #
#  #   # #
#  #   $.#
#  ##$##.#
##$##  #.#
#   $  #.#
#   #  ###
########
`
  },
  // Microban #61
  {
    name: "Microban 61",
    norma: 75,
    data: `
########
#      #
# #### #
# #...@#
# ###$###
# #     #
#  $$ $ #
####   ##
   #.###
   ###
`
  },
  // Microban #62
  {
    name: "Microban 62",
    norma: 65,
    data: `
   ##########
####    ##  #
#  $$$....$@#
#      ###  #
#   #### ####
#####
`
  },
  // Microban #63
  {
    name: "Microban 63",
    norma: 55,
    data: `
#####   ####
#   ##### .#
#       $  ########
###  #### .$    @ #
  #  #  #  ####   #
  ####  ####  #####
`
  },
  // Microban #64
  {
    name: "Microban 64",
    norma: 60,
    data: `
 ######
##    #
#   $ #
#  $$ #
### .#####
  ##.# @ #
   #.  $ #
   #. ####
   ####
`
  },
  // Microban #65
  {
    name: "Microban 65",
    norma: 65,
    data: `
  ######
  #    #
  #  $ #
 ####$ #
## $ $ #
#....# ##
#     @ #
##  #   #
 ########
`
  },
  // Microban #66
  {
    name: "Microban 66",
    norma: 80,
    data: `
   ###
   #@#
 ###$###
##  .  ##
#  # #  #
# #   # #
# #   # #
# #   # #
#  # #  #
## $ $ ##
 ##. .##
  #   #
  #   #
  #####
`
  },
  // Microban #67
  {
    name: "Microban 67",
    norma: 50,
    data: `
#####
#   ##
# #  #
#@$*.##
##  . #
 # $# #
 ##   #
  #####
`
  },
  // Microban #68
  {
    name: "Microban 68",
    norma: 45,
    data: `
 ####
 #  ######
##    $  #
# .# $   #
# .#$#####
# .@ #
######
`
  },
  // Microban #69
  {
    name: "Microban 69",
    norma: 70,
    data: `
####  ####
#  ####  #
#  #  #  #
#  #    $##
#  . .#$  #
#@ ## # $ #
#   . #   #
###########
`
  },
  // Microban #70
  {
    name: "Microban 70",
    norma: 65,
    data: `
#####
# @ ####
#      #
# $ $$ #
##$##  #
#   ####
# ..  #
##..  #
 ###  #
   ####
`
  },
  // Microban #71
  {
    name: "Microban 71",
    norma: 80,
    data: `
###########
#     #   ###
# $@$ # .  .#
# ## ### ## #
# #       # #
# #   #   # #
# ######### #
#           #
#############
`
  },
  // Microban #72
  {
    name: "Microban 72",
    norma: 70,
    data: `
  ####
 ##  #####
 #  $  @ #
 #  $#   #
#### #####
#  #   #
#    $ #
# ..#  #
#  .####
#  ##
####
`
  },
  // Microban #73
  {
    name: "Microban 73",
    norma: 60,
    data: `
####
#  #####
# $$ $ #
#      #
## ## ##
#...#@#
# ### ##
#      #
#  #   #
########
`
  },
  // Microban #74
  {
    name: "Microban 74",
    norma: 65,
    data: `
 ####
 #  #######
 #$ @#   .#
## #$$   .#
#  $  ##..#
#   # #####
###   #
  #####
`
  },
  // Microban #75
  {
    name: "Microban 75",
    norma: 55,
    data: `
 #######
## ....##
#   ######
#   $ $ @#
###  $ $ #
  ###    #
    ######
`
  },
  // Microban #76
  {
    name: "Microban 76",
    norma: 70,
    data: `
 #####
##   #
#    #####
#  #.#   #
#@ #.# $ #
#  #.#  ##
#    #  #
##  ##$$#
 ##     #
  #  ####
  ####
`
  },
  // Microban #77
  {
    name: "Microban 77",
    norma: 60,
    data: `
##########
# @ .... #
#   ####$##
## #  $ $ #
 # $      #
 #   ######
 #####
`
  },
  // Microban #78
  {
    name: "Microban 78",
    norma: 70,
    data: `
 #######
##     ##
#  $ $  #
# $ $ $ #
## ### ####
 #@  .....#
 ##     ###
  #######
`
  },
  // Microban #79
  {
    name: "Microban 79",
    norma: 50,
    data: `
 #########
 #    #  #
## $#$#  #
#  .$.@  #
#  .#    #
##########
`
  },
  // Microban #80
  {
    name: "Microban 80",
    norma: 75,
    data: `
####
#  #######
#  . ## .#
# $#    .#
## ## # .#
 #    #  #
 #### #  #
  # @$ ###
  # $$ #
  #    #
  ######
`
  },
  // Microban #81
  {
    name: "Microban 81",
    norma: 35,
    data: `
 #####
 #   #
 # . #
## * #
#  *##
#  @##
## $ #
 #   #
 #####
`
  },
  // Microban #82
  {
    name: "Microban 82",
    norma: 50,
    data: `
#####
#   ###
# .   ##
##*#$  #
# .# $ #
# @## ##
#     #
#######
`
  },
  // Microban #83
  {
    name: "Microban 83",
    norma: 55,
    data: `
######
#    ##
# $ $ ##
## $$  #
 # #   #
 # ## ##
 #  . .#
 # @. .#
 #  ####
 ####
`
  },
  // Microban #84
  {
    name: "Microban 84",
    norma: 75,
    data: `
########
#  ... #
#  ### ##
#  # $  #
## #@$  #
 # # $  #
 # ### #####
 #         #
 #   ###   #
 ##### #####
`
  },
  // Microban #85
  {
    name: "Microban 85",
    norma: 70,
    data: `
       ####
 #######  #
 # $      #
 #   $ $  #
 # ########
## # .  #
#  # #  #
#  @ . ##
## # # #
 #   . #
 #######
`
  },
  // Microban #86
  {
    name: "Microban 86",
    norma: 55,
    data: `
    ####
  ###  ##
 ## $   #
## $  # #
# @#$$  #
# ..  ###
# ..###
#####
`
  },
  // Microban #87
  {
    name: "Microban 87",
    norma: 60,
    data: `
     ####
######  #
#       #
#  ... .#
##$######
# $  #
#   $###
##  $  #
 ## @  #
  ######
`
  },
  // Microban #88
  {
    name: "Microban 88",
    norma: 80,
    data: `
     ####
 # ###  #
 # #    #
 # #  # #
 # #$ #.#
 # #  # # #
 # #$ #.# #
   #  # # #
####$ #.# #
# @     # #
#   #  ## #
########
`
  },
  // Microban #89
  {
    name: "Microban 89",
    norma: 65,
    data: `
##########
#   ##   #
# $  $@# #
#### # $ #
   #.#  ##
 # #.# $#
 # #.   #
 # #.   #
   ######
`
  },
  // Microban #90
  {
    name: "Microban 90",
    norma: 50,
    data: `
 ########
 #  @   #
 # $  $ #
### ## ###
#  $..$  #
#   ..   #
##########
`
  },
  // Microban #91
  {
    name: "Microban 91",
    norma: 45,
    data: `
###########
#    .##  #
# $$@..$$ #
#   ##.   #
###########
`
  },
  // Microban #92
  {
    name: "Microban 92",
    norma: 85,
    data: `
  ####
  #  #    #####
  #  #    #   #
  #  ######.# #
####  $    .  #
#   $$# ###.# #
#   #   # #   #
######### #@ ##
          #  #
          ####
`
  },
  // Microban #93
  {
    name: "Microban 93",
    norma: 90,
    data: `
 #########
##   #   ##
#    #    #
#  $ # $  #
#   *.*   #
####.@.####
#   *.*   #
#  $ # $  #
#    #    #
##   #   ##
 #########
`
  },
  // Microban #94
  {
    name: "Microban 94",
    norma: 55,
    data: `
#########
# @ #   #
# $ $   #
##$### ##
#  ...  #
#   #   #
######  #
     ####
`
  },
  // Microban #95
  {
    name: "Microban 95",
    norma: 70,
    data: `
########
#@     #
# .$$. #
# $..$ #
# $..$ #
# .$$. #
#      #
########
`
  },
  // Microban #96
  {
    name: "Microban 96",
    norma: 65,
    data: `
  ######
  #    #
  #    #
#####  #
#   #.#####
#   $@$   #
#####.#   #
   ## ## ##
   #   $.#
   #   ###
   #####
`
  },
  // Microban #97
  {
    name: "Microban 97",
    norma: 70,
    data: `
   ####
   #  ########
#### $ $.....#
#   $   ######
#@### ###
#  $  #
# $ # #
## #  #
 #    #
 ######
`
  },
  // Microban #98
  {
    name: "Microban 98",
    norma: 90,
    data: `
#####
#   ## ####
#  $ ### .#
# $   $  .#
## $#####.# ####
# $  # # .###  #
#    # # .#  @ #
###  # #       #
  #### ##     ##
        #######
`
  },
  // Microban #99
  {
    name: "Microban 99",
    norma: 100,
    data: `
               #####
               #   #
#######  ####### # #
#     #  #  #      #
#  @  ####  #     ####
#  #    ....## ####  #
#    ##### ## $$ $ $ #
######   #           #
         #  ##########
         ####
`
  },
  // Microban #100
  {
    name: "Microban 100",
    norma: 55,
    data: `
#######
# @#  #
#.$   #
#. # $##
#.$#   #
#. # $ #
#  #   #
########
`
  },
  // Microban #101
  {
    name: "Lockdown",
    norma: 100,
    data: `
  #####
  #   #
  # # #######
  #  *  #   #
  ## ##   # #
  #     #*  #
### # # # ###
#  *#$+   #
# #   ## ##
#   #  *  #
####### # #
      #   #
      #####
`
  },
  // Microban #102
  {
    name: "Microban 102",
    norma: 60,
    data: `
###########
#....#    #
#  #   $$ #
#  @  ##  #
#     ##$ #
######  $ #
     #    #
     ######
`
  },
  // Microban #103
  {
    name: "Microban 103",
    norma: 50,
    data: `
  #####
  # . ##
### $  #
# . $#@#
# #$ . #
#  $ ###
## . #
 #####
`
  },
  // Microban #104
  {
    name: "Microban 104",
    norma: 55,
    data: `
    #####
#####   #
#    $  #
#  $#$#@#
### #   #
  # ... #
  ###  ##
    #  #
    ####
`
  },
  // Microban #105
  {
    name: "Microban 105",
    norma: 80,
    data: `
 #### ####
##  ###  ##
#   # #   #
#  *. .*  #
###$   $###
 #   @   #
###$   $###
#  *. .*  #
#   # #   #
##  ###  ##
 #### ####
`
  },
  // Microban #106
  {
    name: "Microban 106",
    norma: 70,
    data: `
 ########
 #      #
 #@   $ #
## ###$ #
# .....###
# $ $ $  #
###### # #
     #   #
     #####
`
  },
  // Microban #107
  {
    name: "Microban 107",
    norma: 60,
    data: `
########
#      #
# $*** #
# *  * #
# *  * #
# ***. #
#     @#
########
`
  },
  // Microban #108
  {
    name: "Microban 108",
    norma: 75,
    data: `
####     #####
#  ###   #   ##
#    #   #$ $ #
#..# ##### #  #
#  @    # $ $ #
#..#         ##
##   #########
 #####
`
  },
  // Microban #109
  {
    name: "Microban 109",
    norma: 85,
    data: `
  #######
# #     #
# # # # #
  # @ $ #
### ### #
#   ### #
# $  ##.#
## $  #.#
 ## $  .#
# ## $#.#
## ## #.#
### #   #
### #####
`
  },
  // Microban #110
  {
    name: "Microban 110",
    norma: 50,
    data: `
  ####
###  #
#    ###
# # . .#
# @ ...####
# # # #   ##
#   # $$   #
#####  $ $ #
    ##$ # ##
     #    #
     ######
`
  },
  // Microban #111
  {
    name: "Microban 111",
    norma: 75,
    data: `
######
#    ####
#    ...#
#    ...#
######  #
  #  #  #
  # $$ ##
  # @$  #
  # $$  #
  ## $# #
   #    #
   ######
`
  },
  // Microban #112
  {
    name: "Microban 112",
    norma: 85,
    data: `
 #####
##   ####
#  $$$  #
# #   $ #
#   $## ##
###  #.  #
  #  #   #
 ##### ###
 #   # ##
 # @....#
 #      #
 #   #  #
 ########
`
  },
  // Microban #113
  {
    name: "Microban 113",
    norma: 80,
    data: `
   #####
  ##   #
###  # #
#    . #
#  ## #####
#  . . #  ##
#  # @ $   ###
#####. #  $  #
    ####  $  #
       ## $ ##
        #  ##
        #  #
        ####
`
  },
  // Microban #114
  {
    name: "Microban 114",
    norma: 65,
    data: `
######
#    ###
#  # $ #
#  $ @ #
## ## #####
#  #......#
# $ $ $ $ #
##   ######
 #####
`
  },
  // Microban #115
  {
    name: "Microban 115",
    norma: 70,
    data: `
    #####
#####   ####
#     #    #
#  #.....  #
##  ## # ###
 #$$@$$$ #
 #     ###
 #######
`
  },
  // Microban #116
  {
    name: "Microban 116",
    norma: 55,
    data: `
     #####
   ###   #
####.....#
# @$$$$$ #
#     # ##
#####   #
    #####
`
  },
  // Microban #117
  {
    name: "Microban 117",
    norma: 80,
    data: `
 #### ####
 #  ###  ##
 #      @ #
##..###   #
#      #  #
#...#$  # #
# ## $$ $ #
#  $    ###
####  ###
   ####
`
  },
  // Microban #118
  {
    name: "Microban 118",
    norma: 60,
    data: `
 #####
##   ##
#  $  ##
# $ $  ##
###$# . ##
  # # .  #
 ## ##.  #
 # @  . ##
 #   #  #
 ########
`
  },
  // Microban #119
  {
    name: "Microban 119",
    norma: 55,
    data: `
  ######
  #    ##
 ## ##  #
 # $$ # #
 # @$ # #
 #    # #
#### #  #
#  ... ##
#     ##
#######
`
  },
  // Microban #120
  {
    name: "Microban 120",
    norma: 70,
    data: `
      ####
#######  #
# $      ##
# $#####  #
#  @#  #  #
## ##..   #
#  # ..####
# $  ###
# $###
#  #
####
`
  },
  // Microban #121
  {
    name: "Microban 121",
    norma: 75,
    data: `
 ######
 # .  #
##$.# #
#  *  #
# ..###
##$ # #####
## ## #   #
#  #### # #
#   @ $ $ #
##  #     #
 ##########
`
  },
  // Microban #122
  {
    name: "Microban 122",
    norma: 80,
    data: `
#####
#   ###
# #$  #
# $   #
# $ $ #
# $#  #
#  @###
## ########
#      ...#
#         #
########..#
       ####
`
  },
  // Microban #123
  {
    name: "Microban 123",
    norma: 85,
    data: `
########
#      #
# $ $$ ########
##### @##. .  #
    #$  # .   #
    #   #. . ##
    #$# ## # #
    #        #
    #  ###  ##
    #  # ####
    ####
`
  },
  // Microban #124
  {
    name: "Microban 124",
    norma: 90,
    data: `
##############
#      #     #
# $@$$ # . ..#
## ## ### ## #
 # #       # #
 # #   #   # #
 # ######### #
 #           #
 #############
`
  },
  // Microban #125
  {
    name: "Microban 125",
    norma: 75,
    data: `
      #####
      #   ##
      # $  #
######## #@##
# .  # $ $  #
#        $# #
#...#####   #
#####   #####
`
  },
  // Microban #126
  {
    name: "Microban 126",
    norma: 70,
    data: `
 ###########
##.......  #
# $$$$$$$@ #
#   # # # ##
# # #     #
#   #######
#####
`
  },
  // Microban #127
  {
    name: "Microban 127",
    norma: 60,
    data: `
## ####
####  ####
 # $ $.  #
## #  .$ #
#   ##.###
#  $  . #
# @ #   #
#  ######
####
`
  },
  // Microban #128
  {
    name: "Microban 128",
    norma: 70,
    data: `
  #########
###   #   #
# * $ . . #
#   $ ## ##
####*#   #
 #  @  ###
 #   ###
 #####
`
  },
  // Microban #129
  {
    name: "Microban 129",
    norma: 70,
    data: `
  #########
### @ #   #
# * $ *.. #
#   $ #   #
####*#  ###
 #     ##
 #   ###
 #####
`
  },
  // Microban #130
  {
    name: "Microban 130",
    norma: 65,
    data: `
#####  #####
#   ####.. #
# $$$      #
#   $#  .. #
### @#  ## #
  #  ##    #
  ##########
`
  },
  // Microban #131
  {
    name: "Microban 131",
    norma: 50,
    data: `
#####
#   #
# . #
#.@.###
##.#  #
#  $  #
# $   #
##$$  #
 #  ###
 #  #
 ####
`
  },
  // Microban #132
  {
    name: "Microban 132",
    norma: 60,
    data: `
####
# @###
#.*  #####
#..#$$ $ #
##       #
 # # ##  #
 #   #####
 #####
`
  },
  // Microban #133
  {
    name: "Microban 133",
    norma: 55,
    data: `
 #######
 #  . .###
 # . . . #
### #### #
#  @$  $ #
#  $$  $ #
####   ###
   #####
`
  },
  // Microban #134
  {
    name: "Microban 134",
    norma: 70,
    data: `
        ####
#########  #
#   ## $   #
#  $   ##  #
### #. .# ##
  # #. .#$##
  # #   #  #
  # @ $    #
  #  #######
  ####
`
  },
  // Microban #135
  {
    name: "Microban 135",
    norma: 60,
    data: `
#######
#     #####
# $$#@##..#
# #       #
#  $ # #  #
#### $  ..#
   ########
`
  },
  // Microban #136
  {
    name: "Microban 136",
    norma: 55,
    data: `
 #######
 #     #
## ###$##
#.$   @ #
# .. #$ #
#.##  $ #
#    ####
######
`
  },
  // Microban #137
  {
    name: "Microban 137",
    norma: 75,
    data: `
       ####
      ##  ###
####  #  $  #
#  #### $ $ #
#   ..# #$  #
#  #   @  ###
## #..# ###
 # ## # #
 #      #
 ########
`
  },
  // Microban #138
  {
    name: "Microban 138",
    norma: 80,
    data: `
  ####
###  #
#    ###
# # . .#
# @ ...####
# # # #   ##
#   # $$   #
#####  $ $ #
    ##$ # ##
     #    #
     ######
`
  },
  // Microban #139
  {
    name: "Microban 139",
    norma: 100,
    data: `
 ####
##  ####
#   ...#
#   ...#
#   # ##
#   #@ #### ####
##### $   ###  #
    #  ##$ $   #
   ###     $$  #
   # $  ##   ###
   #    ######
   ######
`
  },
  // Microban #140
  {
    name: "Microban 140",
    norma: 65,
    data: `
######## #####
#  #   ###   #
#      ## $  #
#.# @ ## $  ##
#.#   # $  ##
#.#    $  ##
#. ## #####
##    #
 ######
`
  },
  // Microban #141
  {
    name: "Microban 141",
    norma: 60,
    data: `
  ########
  #  # . #
  #   .*.#
  #  # * #
####$##.##
#      $ #
# $ ## $ #
#   @#   #
##########
`
  },
  // Microban #142
  {
    name: "Microban 142",
    norma: 35,
    data: `
  ####
###  #
#    ####
###$.$  #
#  .@.  #
#  $.$###
####  #
   #  #
   ####
`
  },
  // Microban #143
  {
    name: "Microban 143",
    norma: 90,
    data: `
####
#  ####
# $   #
# .#  #
# $# ##
# .  #
#### #
   # #
 ### ###
 #  $  #
## #$# ##
# $ @ $ #
# ..#.. #
###   ###
  #####
`
  },
  // Microban #144
  {
    name: "Microban 144",
    norma: 100,
    data: `
   ####
 ###  #####
 # $$ #   #
 # $ . .$$##
 # .. #. $ #
### #** .  #
#  . **# ###
# $ .# .. #
##$$.@. $ #
 #   # $$ #
 #####  ###
     ####
`
  },
  // Microban #145
  {
    name: "Microban 145",
    norma: 85,
    data: `
   #####
   # @ #
  ##   ##
###.$$$.###
#  $...$  #
#  $.#.$  #
#  $...$  #
###.$$$.###
  ##   ##
   #   #
   #####
`
  },
  // Microban #146
  {
    name: "Microban 146",
    norma: 80,
    data: `
 #######
##  .  ##
# .$$$. #
# $. .$ #
#.$ @ $.#
# $. .$ #
# .$$$. #
##  .  ##
 #######
`
  },
  // Microban #147
  {
    name: "Microban 147",
    norma: 70,
    data: `
       #####
########   #
#.   .  @#.#
#  ###     #
## $  #    #
 # $   #####
 # $#  #
 ## #  #
  #   ##
  #####
`
  },
  // Microban #148
  {
    name: "Microban 148",
    norma: 65,
    data: `
###########
#  .  #   #
# #.  @   #
#  #..# #######
##  ## $$ $ $ #
 ##           #
  #############
`
  },
  // Microban #149
  {
    name: "Microban 149",
    norma: 60,
    data: `
 ####
##  ###
#@$   #
### $ #
 #  ######
 #  $....#
 #  # ####
 ## # #
 # $# #
 #    #
 #  ###
 ####
`
  },
  // Microban #150
  {
    name: "Microban 150",
    norma: 80,
    data: `
     ####
 #####  #
 #     $#######
## ## ..#  ...#
# $ $$#$  @   #
#        ###  #
#######  # ####
      ####
`
  },
  // Microban #151
  {
    name: "Microban 151",
    norma: 65,
    data: `
   ####
   #  #
 ###  #
##  $ #
#   # #
# #$$ ######
# #   #   .#
#  $  @   .#
###  ####..#
  ####  ####
`
  },
  // Microban #152
  {
    name: "Microban 152",
    norma: 95,
    data: `
###### ####
#     #    #
#.##  #$##  #
#   #     #  #
#$  # ###  #  #
# #      #  # #
# # ####  # # #
#. @    $ * . #
###############
`
  },
  // Microban #153
  {
    name: "Microban 153",
    norma: 110,
    data: `
#############
#.# @#  #   #
#.#$$   # $ #
#.#  # $#   #
#.# $#  # $##
#.#  # $#  #
#.# $#  # $#
#..  # $   #
#..  #  #  #
############
`
  },
  // Microban #154 - Long Way Home
  {
    name: "Long Way Home",
    norma: 500,
    data: `
 ############################
 #                          #
 # ######################## #
 # #                      # #
 # # #################### # #
 # # #                  # # #
 # # # ################ # # #
 # # # #              # # # #
 # # # # ############ # # # #
 # # # # #            # # # #
 # # # # # ############ # # #
 # # # # #              # # #
 # # # # ################ # #
 # # # #                  # #
##$# # #################### #
#. @ #                      #
#############################
`
  },
  // Microban #155 - The Dungeon
  {
    name: "The Dungeon",
    norma: 500,
    data: `
    ######               ####
#####*#  #################  ##
#   ###                      #
#        ########  ####  ##  #
### ####     #  ####  ####  ##
#*# # .# # # #     #     #   #
#*# #  #     # ##  # ##  ##  #
###    ### ###  # ##  # ##  ##
 #   # #*#      #     # #    #
 #   # ###  #####  #### #    #
 #####   #####  ####### ######
 #   # # #**#               #
## # #   #**#  #######  ##  #
#    #########  #    ##### ###
# #             # $        #*#
#   #########  ### @#####  #*#
#####       #### ####   ######
`
  },
];

// Версия набора уровней - при изменении уровней увеличить, чтобы сбросить прогресс
export const LEVELS_VERSION = 9;
